package org.knovash.alicebroker;

import lombok.extern.log4j.Log4j2;

@Log4j2
public class PageIndex {

    public static String page() {
        log.info("PAGE INDEX");

        String page = "<!doctype html><html lang=\"ru\">\n" +
                "<head>\n" +
                "<meta charSet=\"utf-8\" />\n" +
                "<title>Squeeze-Alice cloud</title>" +
                "</head>\n" +
                "<body> \n" +

                "<p><strong>Привет! это навык Умного дома с Алисой для управления плеерами Lyrion Media Server</strong></p> \n" +
                "<a href=\"/html/manual\" target=\"_blank\" rel=\"noopener noreferrer\">Инструкция</a>" +
                "<br>" +


                "Функции:<br>" +
                "<b>Включение устройства \"музыка\"</b> в приложении \"Умный дом с Алисой\" или голосом \"Алиса, включи музыку\"<br>" +
                " 1. Задержка 10 секунд для ожидания выхода из сна плеера LMS (если он только что играл задержки нет, изменяется в настройках)<br>" +
                " 2. Громкость плеера устанавливается по пресету для данного времени (изменяется в настройках)<br>" +
                " 3. Включиться последнее игравшее или если плейлист пуст то включиться первое из избранного LMS<br>" +
                "<b>Выключение устройства \"музыка\"</b> в приложении \"Умный дом с Алисой\" или голосом \"Алиса, выключи музыку\"<br>" +
                " 1. Если плеер LMS играл в группе, отключится от группы, остальные продолжат играть.<br>" +
                " 2. Этот плеер LMS остатанавливает воспроизведение.<br>" +
                "<b>Изменение громкости плеера LMS</b> возможно в приложении или голосом<br>" +
                " \"Алиса, музыку горомче(тише)<br>" +
                " \"Алиса, музыку горомче на 3<br>" +
                " \"Алиса, музыка громкость 12<br>" +
                "<b>Переключение каналов</b> соответствует переключению закладок в избранном LMS<br>" +
                " \"Алиса, включи канал 5\"<br>" +
                " \"Алиса, переключи канал\"" +

//                "Функции:<br>" +
//                "<b>Включение устройства \"музыка\"</b> в приложении \"Умный дом с Алисой\" или голосом \"Алиса, включи музыку\"<br>" +
//                " 1. Задержка 10 секунд для ожидания выхода из сна плеера LMS (если он только что играл задержки нет, изменяется в настройках)<br>" +
//                " 2. Громкость плеера устанавливается по пресету для данного времени (изменяется в настройках)<br>" +
//                " 3. Включиться последнее игравшее или если плейлист пуст то включиться первое из избранного LMS<br>" +
//                "<b>Выключение устройства \"музыка\"</b> в приложении \"Умный дом с Алисой\" или голосом \"Алиса, выключи музыку\"<br>" +
//                " 1. Если плеер LMS играл в группе, отключится от группы, остальные продолжат играть.<br>" +
//                " 2. Этот плеер LMS остатанавливает воспроизведение.<br>" +
//                "<b>Изменение громкости плеера LMS</b> возможно в приложении или голосом<br>" +
//                " \"Алиса, музыку горомче(тише)<br>" +
//                " \"Алиса, музыку горомче на 3<br>" +
//                " \"Алиса, музыка громкость 12<br>" +
//                "<b>Переключение каналов</b> соответствует переключению закладок в избранном LMS<br>" +
//                " \"Алиса, включи канал 5\"<br>" +
//                " \"Алиса, переключи канал\""+

//                "<p><strong>Команды</strong></p> \n" +
//                "<p>Алиса, скажи раз два, что играет</p> \n" +
//                "<p>а) Ответ: сейчас на Homepod1 играет Chillout</p> \n" +
//                "<p>б) Ответ: сейчас на Homepod1 не играет Chillout</p> \n" +
//                "<p>в) Ответ: скажите навыку, это комната и название комнаты, например Гостиная</p> \n" +
//                "<p>Алиса, скажи раз два, это комната гостиная</p> \n" +
//                "<p>а) Ответ: это комната Гостиная. колонка в комнате еще не выбрана</p> \n" +
//                "<p>б) Ответ: это комната Гостиная. с колонкой Homepod1</p> \n" +
//                "<p>Алиса, скажи раз два, выбери колонку homepod</p> \n" +
//                "<p>Ответ: выбрана колонка Homepod1 в комнате Гостиная</p> \n" +
//                "<p>Алиса, скажи раз два, включи канал минимал</p> \n" +
//                "<p>Алиса, скажи раз два, включи избранное минимал</p> \n" +
//                "<p>а) сейчас, мой господин, включаю канал 9, Minimal</p> \n" +
//                "<p>б) повторите</p> \n" +

                "</body>\n" +
                "</html>";
        return page;
    }
}